In [1]:
import configparser
import boto3
import json
config = configparser.ConfigParser()
config.read_file(open('dwh.cfg'))

In [2]:
DWH_DB_USER       = config.get('CLUSTER','DB_USER')
DWH_DB_PASSWORD   = config.get('CLUSTER','DB_PASSWORD')
DWH_ENDPOINT      = config.get('CLUSTER','HOST')
DWH_PORT          = config.get('CLUSTER','DB_PORT')
DWH_DB            = config.get('CLUSTER','DB_NAME')
DWH_DB            = config.get('CLUSTER','DB_NAME')
ARN               = config.get("IAM_ROLE", "ARN")

In [3]:
%load_ext sql

In [4]:
conn_string="postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn_string)
%sql $conn_string

postgresql://dwhuser:Passw0rd@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh

'Connected: dwhuser@dwh'

# Practice Importing All The Tables

In [5]:
# Import all the SQL queries
from sql_queries import *

In [6]:
# Drop all the tables
for drop_query in drop_table_queries:
    print(drop_query)
    %sql $drop_query

DROP TABLE  IF EXISTS staging_events;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS staging_songs;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS songplay;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS users;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS songs;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS artists;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
DROP TABLE  IF EXISTS time;
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

In [7]:
for table_create_query in create_table_queries:
    # print(table_create_query)
    %sql $table_create_query

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.
 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

``` sql
%%sql

SELECT DISTINCT(tablename) FROM PG_TABLE_DEF WHERE schemaname = 'public';
```

In [8]:
%%sql
TRUNCATE staging_songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [9]:
## Now to input the JSON into a table from S3 into Redshift

# s3_insert_query = """
# COPY staging_songs FROM 's3://udacity-dend/song_data' 
# iam_role '{}'
# format as json 'auto';""".format(ARN)
s3_insert_query = """
COPY staging_songs FROM 's3://udacity-dend/song_data/A/B/Q/TRABQTA128F148D048.json' 
iam_role '{}'
format as json 'auto';""".format(ARN)
print(s3_insert_query)

COPY staging_songs FROM 's3://udacity-dend/song_data/A/B/Q/TRABQTA128F148D048.json'
iam_role 'arn:aws:iam::245289978277:role/dwhRole'
format as json 'auto';

In [10]:
%sql $s3_insert_query

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [11]:
%%sql
SELECT COUNT(*) FROM staging_songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [12]:
%%sql
SELECT * FROM staging_songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('SOJOVBQ12A6D4F96B6', None, 'A Heart Without A Home', 'The Hellacopters', None, 2000, 230.1122, 'ARSEMJF1187FB5641E', None, 'Sweden')]

## What about ndjson?

In [13]:
%%sql
TRUNCATE staging_events;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [14]:
# s3_insert_query = """
# COPY staging_events FROM 's3://udacity-dend/log_data' 
# iam_role '{}'
# format as json 'auto ignorecase';""".format(ARN)

s3_insert_query = """
COPY staging_events FROM 's3://udacity-dend/log_data/2018/11/2018-11-05-events.json' 
iam_role '{}'
format as json 'auto ignorecase';""".format(ARN)
print(s3_insert_query)

COPY staging_events FROM 's3://udacity-dend/log_data/2018/11/2018-11-05-events.json'
iam_role 'arn:aws:iam::245289978277:role/dwhRole'
format as json 'auto ignorecase';

In [15]:
%sql $s3_insert_query

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [16]:
%%sql
select COUNT(*) from staging_events
LIMIT 10;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(408,)]

In [17]:
%%sql
SELECT * FROM stl_load_errors
LIMIT 10;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

## Transformation Time

* Let's first take staging_songs table and get the artists working as an example

**Example ETL SQL Query**
``` sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;
```

## ETL artists table

I am having an issue inserting distinct artist_id from the staging_songs table into the artists table. I am really confused how I am getting a different number for the number for duplicate artist_id's and distinct artist_id's. But before I show my thinking process I want to articulate my understanding of previous questions here on Udacity.

[Knowledge - Udacity](https://knowledge.udacity.com/questions/440181)

From this question about using UPSERT on redshift I learned that UPSERT is not supported on REDSHIFT and to reference the [AWS Redshift docs](https://docs.aws.amazon.com/redshift/latest/dg/t_updating-inserting-using-staging-tables-.htm)
The AWS Redshift documentation talks about updating and deleting stuff rather than trying to have a UNIQUE constraint
Therefore is the best thing to do is insert form the staging_songs table all the columns then go through and delete any columns that are not distonct/unique?

[Knowledge - Udacity](https://knowledge.udacity.com/questions/474021)

This answer says to use DISTINCT which I already was using

[Knowledge - Udacity](https://knowledge.udacity.com/questions/775809)

This answer also says to use DISTINCT
Use Group By, which I tried an had an issue (see below)

## Process I followed to get the confusing numbers

``` sql
SELECT COUNT(*) FROM staging_songs;
```

I get a count of 14896 back. Now I get how many distinct artist_id's are in the staging_songs table

``` sql
SELECT COUNT(DISTINCT artist_id) FROM staging_songs;
```

I get a count of 9553 back. Therefore I can not calculate the number of duplicate artist_id's there are.

14896 rows in staging_songs - 9553 distinct artist_id's = 5343 duplicate artist_id's in the staging_songs table.

Now I insert from the staging_songs table into the artists table using distinct on artist_id, when I try and use 

```sql
INSERT INTO artists (artist_id, name, location, latitude, longitude)
    SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs;
```

I tried using GROUP BY like the third question I referenced above but I get the error, "column "staging_songs.artist_name" must appear in the GROUP BY clause or be used in an aggregate function". Is this a case where I can use a subquery?

Next I get the number of rows in the artists table.

```sql
SELECT COUNT(*) FROM artists;
```

Returns 10025 results, which does not look right to me, I expect 9553 rows. Now I check for distinct artists....

```sql
SELECT COUNT(DISTINCT artist_id) FROM artists;
```

Returns a COUNT of 9553. This matches the number of distinct artist_id I had in the staging_songs table.

``` sql
SELECT COUNT(*) from artists;
```

Returns a COUNT of 10025, then I do a query to get the number of duplicate artist_id in artists

``` sql
SELECT artist_id, 
 COUNT(artist_id) AS NumOccurrences
FROM staging_songs
GROUP BY artist_id
HAVING ( COUNT(artist_id) > 1 )
ORDER BY NumOccurrences desc
```

Source: [Finding Duplicates with SQL](https://www.petefreitag.com/item/169.cfm)

And I get 3349 results with the NumOccurrences counting up to numbers as high as 9.

How is it possible that I can insert what should be distinct values and have (10025-9553)=472, 472 duplicates but when I count the number of duplicate entries being over 3000? Let's check if these NumOccurrences actually matches up. I write a query to see if I actually get 9 instances with the artist_id.

``` sql
SELECT * FROM staging_songs
WHERE artist_id = 'ARYPTWE1187FB49D64';
```

Got 9 results back?

How can I have 3349 duplicate artist_id's in the artists table, a total of 10025 total results and 9553 distinct artist_id values.

## Summary

Do I even need to worry about distinct artist_id's in the artists table?
Where in my logic am I wrong when calculating the distinct and duplicate artist_id's in the staging_artists and artists table?
Is it a good idea to dump everything from staging_songs into artists then delete duplicates?
Is my SQL query to find duplicates correct?
Do I need to go back and review some core SQL knowledge, if so what, or am I missing something nuanced?

In [18]:
print(artist_table_insert)

INSERT INTO artists (artist_id, name, location, latitude, longitude)
    SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs;

In [19]:
%%sql
TRUNCATE TABLE ARTISTS;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [20]:
%%sql
SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs
    GROUP BY artist_id;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "staging_songs.artist_name" must appear in the GROUP BY clause or be used in an aggregate function
 [SQL: 'SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude\n    FROM staging_songs\n    GROUP BY artist_id;']

In [21]:
%%sql
SELECT COUNT(*) FROM staging_songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [22]:
second_artist_table_insert = """
INSERT INTO artists (artist_id, name, location, latitude, longitude)
    SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs
    WHERE artist_id NOT IN (SELECT DISTINCT artist_id FROM artists);
"""

In [23]:
print(artist_table_insert)

INSERT INTO artists (artist_id, name, location, latitude, longitude)
    SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs;

In [24]:
%sql $artist_table_insert

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[]

In [25]:
%%sql
SELECT COUNT(*) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [26]:
%%sql
SELECT COUNT(DISTINCT(artist_id)) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [27]:
%%sql
SELECT COUNT(*) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [28]:
%%sql
SELECT DISTINCT(artist_id) from artists
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('ARSEMJF1187FB5641E',)]

In [29]:
%%sql
SELECT DISTINCT(artist_id), artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs
    WHERE artist_id NOT IN (SELECT DISTINCT artist_id FROM artists);

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

In [30]:
%%sql
SELECT artist_id, 
 COUNT(artist_id) AS NumOccurrences
FROM staging_songs
GROUP BY artist_id
HAVING ( COUNT(artist_id) > 1 )
ORDER BY NumOccurrences desc
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

In [31]:
%%sql
SELECT * FROM staging_songs
WHERE artist_id = 'ARYPTWE1187FB49D64';

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

In [32]:
%%sql
SELECT COUNT(DISTINCT(artist_id)) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [33]:
%%sql
SELECT DISTINCT (artist_id) , artist_name
    FROM staging_songs
    GROUP BY ts;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "ts" does not exist in staging_songs
 [SQL: 'SELECT DISTINCT (artist_id) , artist_name\n    FROM staging_songs\n    GROUP BY ts;']

In [34]:
%%sql
SELECT DISTINCT(artist_id) as p_key, artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs
    GROUP BY p_key, artist_name, artist_location, artist_latitude, artist_longitude
    HAVING ( COUNT(p_key) > 1 );

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

In [35]:
%%sql
SELECT COUNT(DISTINCT(artist_id)) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

## ETL songs table

``` sql
%%sql
SELECT f.title, p.amount, p.payment_date, p.customer_id                                            
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
limit 5;
```

In [36]:
%%sql
INSERT INTO songs (song_id, title, artist_id, year, duration)
    SELECT DISTINCT(song_id), title, artist_id, year, duration 
    FROM staging_songs

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[]

In [37]:
%%sql
SELECT COUNT(*) FROM songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [38]:
%%sql
SELECT COUNT(DISTINCT(song_id)) FROM songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

## Transaction songs AND artists table

``` sql
BEGIN TRANSACTION
   DECLARE @DataID int;
   INSERT INTO DataTable (Column1 ...) VALUES (....);
   SELECT @DataID = scope_identity();
   INSERT INTO LinkTable VALUES (@ObjectID, @DataID);
COMMIT
```

[SQL Server: Is it possible to insert into two tables at the same time? - Stack Overflow](https://stackoverflow.com/questions/175066/sql-server-is-it-possible-to-insert-into-two-tables-at-the-same-time)


``` sql
INSERT INTO artists (artist_id, name, location, latitude, longitude)
    SELECT artist_id, artist_name, artist_location, artist_latitude, artist_longitude
    FROM staging_songs;
INSERT INTO songs (song_id, title, artist_id, year, duration)
    SELECT song_id, title, artist_id, year, duration 
    FROM staging_songs;
```

In [39]:
%%sql
SELECT COUNT(*) from artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

## How to convert a string to a TIMESTAMP or DATE

* [DATEADD function - Amazon Redshift](https://docs.aws.amazon.com/redshift/latest/dg/r_DATEADD_function.html)
* [How to convert epoch to datetime redshift? - Stack Overflow](https://stackoverflow.com/questions/39815425/how-to-convert-epoch-to-datetime-redshift)

In [40]:
%%sql
SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01')
FROM staging_events LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(datetime.datetime(2018, 11, 5, 0, 33, 12, 796000),),
 (datetime.datetime(2018, 11, 5, 1, 27, 22, 796000),),
 (datetime.datetime(2018, 11, 5, 1, 30, 56, 796000),),
 (datetime.datetime(2018, 11, 5, 1, 34, 54, 796000),),
 (datetime.datetime(2018, 11, 5, 1, 40, 40, 796000),)]

## Practice getting events into the time table

**Reminder Query for Syntax**

``` sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;
```

In [41]:
%%sql
SELECT 12;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(12,)]

In [42]:
%%sql
SELECT CASE WHEN 5 IN (5, 6) THEN true ELSE false END;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(True,)]

In [43]:
%%sql
SELECT CASE WHEN 2 IN (5, 6) THEN true ELSE false END;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(False,)]

In [44]:
%%sql
SELECT 
  date_add('ms',CAST(ts as BIGINT),'1970-01-01') as staged_date,
  EXTRACT(WEEKDAY FROM staged_date)
FROM staging_events
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(datetime.datetime(2018, 11, 5, 0, 33, 12, 796000), 1),
 (datetime.datetime(2018, 11, 5, 1, 27, 22, 796000), 1),
 (datetime.datetime(2018, 11, 5, 1, 30, 56, 796000), 1),
 (datetime.datetime(2018, 11, 5, 1, 34, 54, 796000), 1),
 (datetime.datetime(2018, 11, 5, 1, 40, 40, 796000), 1)]

In [45]:
%%sql
SELECT 
  date_add('ms',CAST(ts as BIGINT),'1970-01-01') as staged_date,
  CASE WHEN EXTRACT(WEEKDAY FROM staged_date) IN (6,7) THEN true ELSE false END
FROM staging_events
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(datetime.datetime(2018, 11, 5, 0, 33, 12, 796000), False),
 (datetime.datetime(2018, 11, 5, 1, 27, 22, 796000), False),
 (datetime.datetime(2018, 11, 5, 1, 30, 56, 796000), False),
 (datetime.datetime(2018, 11, 5, 1, 34, 54, 796000), False),
 (datetime.datetime(2018, 11, 5, 1, 40, 40, 796000), False)]

In [46]:
%%sql
SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01') as staged_date,
    EXTRACT(hour FROM staged_date),
    EXTRACT(day FROM staged_date),
    EXTRACT(month FROM staged_date),
    EXTRACT(year FROM staged_date),
    CASE WHEN EXTRACT(WEEKDAY FROM staged_date) IN (6,7) THEN true ELSE false END
FROM staging_events
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(datetime.datetime(2018, 11, 5, 0, 33, 12, 796000), 0, 5, 11, 2018, False),
 (datetime.datetime(2018, 11, 5, 1, 27, 22, 796000), 1, 5, 11, 2018, False),
 (datetime.datetime(2018, 11, 5, 1, 30, 56, 796000), 1, 5, 11, 2018, False),
 (datetime.datetime(2018, 11, 5, 1, 34, 54, 796000), 1, 5, 11, 2018, False),
 (datetime.datetime(2018, 11, 5, 1, 40, 40, 796000), 1, 5, 11, 2018, False)]

Not using this anymore use query from sql_queries.py
``` sql
%%sql
INSERT INTO time (start_time, hour, day, month, year, weekday)
SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01') as staged_date,
    EXTRACT(hour FROM staged_date),
    EXTRACT(day FROM staged_date),
    EXTRACT(month FROM staged_date),
    EXTRACT(year FROM staged_date),
    CASE WHEN EXTRACT(WEEKDAY FROM staged_date) IN (6,7) THEN true ELSE false END
FROM staging_events;
```

In [47]:
%sql $time_table_insert

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
408 rows affected.

[]

In [48]:
%%sql
SELECT COUNT(*) FROM time
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(408,)]

## Practice getting events into the users table

In [49]:
%%sql
SELECT DISTINCT(userId), firstName, lastName, gender, level
    FROM staging_events
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: 'SELECT DISTINCT(userId), firstName, lastName, gender, level\n    FROM staging_events\n    LIMIT 5;']

In [50]:
%%sql
SELECT CAST(userId as INT), firstName, lastName, gender, level
    FROM staging_events
    WHERE userId != ' '
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT CAST(userId as INT), firstName, lastName, gender, level\n    FROM staging_events\n    WHERE userId != ' '\n    LIMIT 5;"]

## Unique is not enforced on AMAZON Redshift

* [Defining table constraints - Amazon Redshift](https://docs.aws.amazon.com/redshift/latest/dg/t_Defining_constraints.html)

## Thinking

Since we need to update the level we should be doing an UPDATE if the INSERT fails

In [51]:
%%sql
SELECT COUNT(*) FROM staging_events
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(408,)]

In [52]:
%%sql
SELECT DISTINCT(userId) as user_tmp, CAST(user_tmp as INT) as user_tmp_1
    FROM staging_events
    WHERE userId != ' '
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT DISTINCT(userId) as user_tmp, CAST(user_tmp as INT) as user_tmp_1\n    FROM staging_events\n    WHERE userId != ' '\n    LIMIT 5;"]

In [53]:
%%sql
SELECT DISTINCT(userId), firstName, lastName, gender, level FROM staging_events
WHERE userId != ' '
ORDER BY
    ts ASC
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT DISTINCT(userId), firstName, lastName, gender, level FROM staging_events\nWHERE userId != ' '\nORDER BY\n    ts ASC\nlimit 5;"]

## Other Failed Tries for the users table to make sure they are unique

``` sql
%%sql
MERGE INTO users USING staging_events ON (users.user_id = CAST(staging_events.userId as INT))
WHEN MATCHED
    update users
        SET
            users.first_name = staging_events.firstName
            users.last_name  = staging_events.lastName
            users.gender     = staging_events.gender
            users.level      = staging_events.level
        WHERE user_id=44
THEN INSERT
    INSERT INTO users (user_id, first_name, last_name, gender, level)
    SELECT CAST(userId as INT), firstName, lastName, gender, level
        FROM staging_events;
```

``` sql
%%sql
INSERT INTO users (user_id, first_name, last_name, gender, level)
SELECT CAST(userId as INT), firstName, lastName, gender, level
    FROM staging_events
    WHERE userId != ' '
    ORDER BY
        ts ASC;
```

``` sql
%%sql
SELECT CASE WHEN
    EXISTS(SELECT 1 from users where user_id=44)
THEN
    'update'
ELSE
    'insert'
END;
```

``` sql
%%sql
SELECT CASE WHEN
    EXISTS(SELECT 1 from users where user_id=44)
THEN
    update users
        SET
            first_name = firstName
            last_name  = lastName
            gender     = gender
            level      = level
        WHERE user_id=44
ELSE
    INSERT INTO users (user_id, first_name, last_name, gender, level)
    SELECT CAST(userId as INT), firstName, lastName, gender, level
        FROM staging_events
END;
```

In [54]:
%%sql
SELECT COUNT(*) FROM users;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(0,)]

In [55]:
%%sql
SELECT COUNT(DISTINCT(user_id)) FROM users;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(0,)]

## Troubleshooting users table transofmration

Alright so we will either be inserting or updating, but then how do I loop through the program when we insert by default. Can I select everything within users then go through them one by one.

**The following query just dumps everything**
``` sql
%%sql
INSERT INTO users (user_id, first_name, last_name, gender, level)
SELECT CAST(userId as INT), firstName, lastName, gender, level
    FROM staging_events
    WHERE userId != ' ';
```

In [56]:
%%sql
TRUNCATE users

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
Done.

[]

In [57]:
%%sql
SELECT DISTINCT(userId) as user_id, firstName, lastName, gender, level
    FROM staging_events
    WHERE userId != ' '
    ORDER BY ts desc
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT DISTINCT(userId) as user_id, firstName, lastName, gender, level\n    FROM staging_events\n    WHERE userId != ' '\n    ORDER BY ts desc\n    LIMIT 5;"]

Use sql_querys.py
``` sql
%%sql
INSERT INTO users (user_id, first_name, last_name, gender, level)
SELECT DISTINCT(userId) as user_id, firstName, lastName, gender, level
    FROM staging_events
    WHERE userId != ' '
    ORDER BY ts desc;
```

In [58]:
%sql $user_table_insert

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "INSERT INTO users (user_id, first_name, last_name, gender, level)\nSELECT DISTINCT(userId) as user_id, firstName, lastName, gender, level\n    FROM staging_events\n    WHERE page ='NextSong'"]

In [59]:
%%sql
SELECT COUNT(DISTINCT(user_id)) FROM users
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(0,)]

In [60]:
%%sql
SELECT COUNT((user_id)) FROM users
LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(0,)]

## Practice getting events into the songplays table

* songplays not NULLs are
  * start_time
  * user_id
  * session_id
  * user_agent
* Map staging_events into songplays
  * ts -> start_time
  * userId -> user_id
  * level -> level
  * **song_id TODO**
  * **artist_id TODO**
  * sessionId -> session_id
  * location -> location
  * userAgent -> user_agent

In [61]:
%%sql
SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01'), CAST(userId as INT), level, sessionId, staging_events.location, userAgent
    FROM staging_events
    WHERE userId != ' '
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01'), CAST(userId as INT), level, sessionId, staging_events.location, userAgent\n    FROM staging_events\n    WHERE userId != ' '\n    LIMIT 5;"]

In [62]:
%%sql
SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01'), CAST(userId as INT), level, s.song_id, sessionId, staging_events.location, userAgent
    FROM staging_events
    JOIN songs s      ON ('A Heart Without A Home'   = s.title) 
    WHERE userId != ' '
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events, s, unnamed_join
 [SQL: "SELECT date_add('ms',CAST(ts as BIGINT),'1970-01-01'), CAST(userId as INT), level, s.song_id, sessionId, staging_events.location, userAgent\n    FROM staging_events\n    JOIN songs s      ON ('A Heart Without A Home'   = s.title) \n    WHERE userId != ' '\n    LIMIT 5;"]

In [63]:
%%sql
SELECT 
    date_add('ms',CAST(ts as BIGINT),'1970-01-01'),
    CAST(userId as INT), 
    level,
    (SELECT song_id FROM songs     WHERE songs.title   = 'A Heart Without A Home' LIMIT 1) as song_id,
    (SELECT artist_id FROM artists WHERE artists.name  = 'The Hellacopters' LIMIT 1) as artist_id,
    sessionId, 
    staging_events.location, 
    userAgent
        FROM staging_events
        WHERE userId != ' '
        LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT \n    date_add('ms',CAST(ts as BIGINT),'1970-01-01'),\n    CAST(userId as INT), \n    level,\n    (SELECT song_id FROM songs     WHERE songs.title   = 'A Heart Without A Home' LIMIT 1) as song_id,\n    (SELECT artist_id FROM artists WHERE artists.name  = 'The Hellacopters' LIMIT 1) as artist_id,\n    sessionId, \n    staging_events.location, \n    userAgent\n        FROM staging_events\n        WHERE userId != ' '\n        LIMIT 5;"]

In [64]:
%%sql
SELECT COUNT(*) FROM staging_events WHERE userId = ' ';

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
(psycopg2.ProgrammingError) column "userid" does not exist in staging_events
 [SQL: "SELECT COUNT(*) FROM staging_events WHERE userId = ' ';"]

Use sqlqueries.py
``` sql
%%sql
INSERT INTO songplays ( start_time, user_id, level, song_id, artist_id, session_id, location, user_agent)
    SELECT 
        date_add('ms',CAST(ts as BIGINT),'1970-01-01'),
        CAST(userId as INT), 
        level,
        (SELECT song_id FROM songs     WHERE songs.title   = 'A Heart Without A Home' LIMIT 1),
        (SELECT artist_id FROM artists WHERE artists.name  = 'The Hellacopters' LIMIT 1),
        sessionId, 
        staging_events.location, 
        userAgent
            FROM staging_events
            WHERE userId != ' ';
```

In [65]:
%%sql
SELECT 'songplays' as title, COUNT(*) FROM songplays;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('songplays', 0)]

In [66]:
%%sql
SELECT 'users'     as title, COUNT(DISTINCT(user_id)) FROM users;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('users', 0)]

In [67]:
%%sql
SELECT 'users'     as title, COUNT(*) FROM users;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('users', 0)]

In [68]:
%%sql
SELECT 'time'      as title, COUNT(*) FROM time;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('time', 408)]

In [69]:
%%sql
SELECT 'time'      as title, COUNT(DISTINCT(start_time)) FROM time;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('time', 405)]

In [70]:
%%sql
SELECT 'songs'     as title, COUNT(*) FROM songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('songs', 1)]

In [71]:
%%sql
SELECT 'artists'   as title, COUNT(*) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[('artists', 1)]

In [72]:
%%sql
SELECT COUNT(DISTINCT(artist_id)) FROM artists;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [73]:
%%sql
SELECT COUNT(DISTINCT(song_id)) FROM songs;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [74]:
%%sql
SELECT COUNT(*) FROM songs
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
1 rows affected.

[(1,)]

In [62]:
%%sql
SELECT song_id, title, a.artist_id, year, duration 
    FROM staging_songs s
    JOIN artists a     ON (s.artist_name=a.name)
    LIMIT 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('SOXAALK12A8C13AEC8', 'Geraldine', 'ARQY5EG1187FB57063', 0, 399.49016),
 ('SOJUCAI12A8C135D62', 'New Life', 'ARQY5EG1187FB57063', 0, 325.25016),
 ('SOKKLAD12A6D4FD1C0', 'The Music Inside', 'ARQY5EG1187FB57063', 1998, 321.2273),
 ('SOWHZXF12A67AD9127', 'Solo', 'AR7YD6B1187B99210E', 1996, 306.72934),
 ('SOFWWLR12A6D228195', 'Uno Mas', 'AR7YD6B1187B99210E', 0, 196.88444)]

In [63]:
%%sql
SELECT artist_id, COUNT(artist_id)
FROM artists
GROUP BY artist_id
HAVING COUNT(artist_id) > 1
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('ARF9EI11187B9AB66C', 2),
 ('ARABTW91187FB3A73B', 2),
 ('ARUWLCL1187FB549B8', 2),
 ('ARZ5CQT1187FB4CF24', 2),
 ('ARNQESK11F4C83FD6F', 3)]

In [64]:
%%sql
SELECT song_id, COUNT(song_id)
FROM songs
GROUP BY song_id
HAVING COUNT(song_id)>1
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
0 rows affected.

[]

In [65]:
%%sql
SELECT user_id, COUNT(user_id)
FROM users
GROUP BY user_id
HAVING COUNT(user_id)>1
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[('49', 2), ('16', 2), ('88', 2), ('15', 2), ('29', 2)]

In [66]:
%%sql
SELECT start_time, COUNT(start_time)
FROM time
GROUP BY start_time
HAVING COUNT(start_time)>1
limit 5;

 * postgresql://dwhuser:***@dwhcluster.cexlscovpa8u.us-west-2.redshift.amazonaws.com:5439/dwh
5 rows affected.

[(datetime.datetime(2018, 11, 9, 18, 22, 40, 796000), 2),
 (datetime.datetime(2018, 11, 25, 17, 29, 5, 796000), 2),
 (datetime.datetime(2018, 11, 30, 16, 34, 12, 796000), 2),
 (datetime.datetime(2018, 11, 4, 15, 25, 29, 796000), 2),
 (datetime.datetime(2018, 11, 9, 18, 31, 5, 796000), 2)]